Revit 2027 API
NumberingSchema.SetFormatting Method
 Set the NumberingFormatSettings for this schema.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFormatting(
	NumberingFormatSettings formattingSettings
)
Public Sub SetFormatting (
	formattingSettings As NumberingFormatSettings
)
public:
void SetFormatting(
	NumberingFormatSettings^ formattingSettings
)
member SetFormatting :
        formattingSettings : NumberingFormatSettings -> unit
Parameters
formattingSettings NumberingFormatSettings
 Complete configuration settings for formatting numbers numbers in this schema.
Exceptions
Exception | Condition
ArgumentException |  The input formattingSettings in not valid for this numbering schema.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace